{
  "_name_or_path": "indolem/indobert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "sapa",
    "1": "salam",
    "2": "sampai jumpa",
    "3": "nama",
    "4": "Deskripsi",
    "5": "Kitab",
    "6": "Kitab2",
    "7": "bersuci",
    "8": "pasal:air_suci",
    "9": "pasal:macam_air",
    "10": "pasal:macam_air_mutlaq",
    "11": "pasal:macam_air_mustaqmal",
    "12": "pasal:macam_air_musyammas",
    "13": "pasal:macam_air_najis",
    "14": "pasal:Menyamak_kulit",
    "15": "pasal:perabot_yang_haram",
    "16": "pasal:siwak",
    "17": "pasal:wudhu",
    "18": "pasal:istinja_cebok",
    "19": "pasal:batal_wudhu",
    "20": "pasal:mandi_junub",
    "21": "pasal:mandi_junub2",
    "22": "pasal:mandi_sunnah",
    "23": "pasal:muzah",
    "24": "pasal:tayamum",
    "25": "pasal:Najis_Pensuciannya_1",
    "26": "pasal:Najis_Pensuciannya_2",
    "27": "pasal:Haid_Nifas_istihadhoh",
    "28": "pasal:Haid_Nifas_istihadhoh2",
    "29": "pasal:Haid_Nifas_istihadhoh3",
    "30": "sholat",
    "31": "sholat_wajib",
    "32": "sholat_wajib2",
    "33": "sholat_sunnah",
    "34": "syarat_wajib_sholat",
    "35": "syarat_sah_sholat",
    "36": "rukun_sholat",
    "37": "perbedaan_laki2_perempuan_dalam_sholat",
    "38": "hal_batal_sholat",
    "39": "jumlah_rakaat_sholat",
    "40": "perkara_yang_tertinggal_dalam_sholat",
    "41": "waktu_makhruh_sholat",
    "42": "sholat_jamaah",
    "43": "meringkas_dan_mengumpulakn_sholat",
    "44": "shalat_jumat",
    "45": "zakat",
    "46": "zakat_fitrah",
    "47": "puasa",
    "48": "Haji",
    "49": "pasal:Syarat_haji",
    "50": "Jual Beli",
    "51": "mawaris",
    "52": "Nikah",
    "53": "pidana",
    "54": "hukuman",
    "55": "jihad",
    "56": "binatang",
    "57": "perlombaan",
    "58": "sumpah dan nadzar",
    "59": "peradilan",
    "60": "budak",
    "61": "penghormatan",
    "62": "task"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Deskripsi": 4,
    "Haji": 48,
    "Jual Beli": 50,
    "Kitab": 5,
    "Kitab2": 6,
    "Nikah": 52,
    "bersuci": 7,
    "binatang": 56,
    "budak": 60,
    "hal_batal_sholat": 38,
    "hukuman": 54,
    "jihad": 55,
    "jumlah_rakaat_sholat": 39,
    "mawaris": 51,
    "meringkas_dan_mengumpulakn_sholat": 43,
    "nama": 3,
    "pasal:Haid_Nifas_istihadhoh": 27,
    "pasal:Haid_Nifas_istihadhoh2": 28,
    "pasal:Haid_Nifas_istihadhoh3": 29,
    "pasal:Menyamak_kulit": 14,
    "pasal:Najis_Pensuciannya_1": 25,
    "pasal:Najis_Pensuciannya_2": 26,
    "pasal:Syarat_haji": 49,
    "pasal:air_suci": 8,
    "pasal:batal_wudhu": 19,
    "pasal:istinja_cebok": 18,
    "pasal:macam_air": 9,
    "pasal:macam_air_mustaqmal": 11,
    "pasal:macam_air_musyammas": 12,
    "pasal:macam_air_mutlaq": 10,
    "pasal:macam_air_najis": 13,
    "pasal:mandi_junub": 20,
    "pasal:mandi_junub2": 21,
    "pasal:mandi_sunnah": 22,
    "pasal:muzah": 23,
    "pasal:perabot_yang_haram": 15,
    "pasal:siwak": 16,
    "pasal:tayamum": 24,
    "pasal:wudhu": 17,
    "penghormatan": 61,
    "peradilan": 59,
    "perbedaan_laki2_perempuan_dalam_sholat": 37,
    "perkara_yang_tertinggal_dalam_sholat": 40,
    "perlombaan": 57,
    "pidana": 53,
    "puasa": 47,
    "rukun_sholat": 36,
    "salam": 1,
    "sampai jumpa": 2,
    "sapa": 0,
    "shalat_jumat": 44,
    "sholat": 30,
    "sholat_jamaah": 42,
    "sholat_sunnah": 33,
    "sholat_wajib": 31,
    "sholat_wajib2": 32,
    "sumpah dan nadzar": 58,
    "syarat_sah_sholat": 35,
    "syarat_wajib_sholat": 34,
    "task": 62,
    "waktu_makhruh_sholat": 41,
    "zakat": 45,
    "zakat_fitrah": 46
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.18.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31923
}
